import { inject, observer } from 'mobx-react'
import * as React from 'react'
import { RouteComponentProps } from 'react-router'
import { Link } from 'react-router-dom'

import { IconChevronRight } from '../../components/icons'
import { IUIStateProps } from '../../store'

@inject('ui')
@observer
export class AfterSale extends React.Component<IUIStateProps> {
  constructor(props: IUIStateProps) {
    super(props)
    props.ui!.setNavigationBarTitle('售后问题')
  }
  public render() {
    return (
      <div className="help-center-page">
        <ul className="list-view">
          <li><Link to="/help/after-sale/1">退换货政策<IconChevronRight /></Link></li>
          <li><Link to="/help/after-sale/2">退换货运费谁来承担？<IconChevronRight /></Link></li>
          <li><Link to="/help/after-sale/3">退换货地址说明<IconChevronRight /></Link></li>
          <li><Link to="/help/after-sale/4">退款处理时间及去向<IconChevronRight /></Link></li>
        </ul>
      </div>
    )
  }
}

interface ISectionProps extends RouteComponentProps<{ section: number }> {

}

@inject('ui')
@observer
export class AfterSaleSection extends React.Component<IUIStateProps & ISectionProps> {
  public render() {
    return (
      <div className="help-center-page help-center-content">
        {[退换货政策, 退换货运费谁来承担, 退换货流程及地址说明, 退款处理时间以及去向][this.props.match.params.section - 1]}
      </div>
    )
  }
}

const 退换货政策 = (
  <div>
    <h2>退换货政策</h2>
    <p>闪送商城严格遵循国家法规，对所售商品履行退换货义务。</p>
    <ul>
      <li>
        <p>用户在签收商品后，符合以下情况，我们将提供14天退换货，如涉及保修则在保修期内可以联系客服申请保修。具体标准如下：</p>
        <ul>
          <li>（ 1 ）国家法律规定的功能性故障或商品质量问题支持14天退换货（售罄情况下只能退货），返程运费收取详见退换货费用说明。</li>
          <li>（ 2 ）到货物流损、缺件或商品描述与网站不符 支持14天退换货（售罄情况下只能退货），返程运费收取详见退换货费用说明。</li>
          <li>（ 3 ）其他原因（除以上两种原因之外，如个人原因的无理由退换货，在商品完好，附件齐全、不影响二次销售的前提下。） 支持14天退换货（有标注“不支持无理由退货”、“不支持无理由换货”、“不支持无理由退换货”、定制商品等情况除外）</li>
        </ul>
        <p>注意事项</p>
        <ul>
          <li>（ 1 ）除不支持无理由换货的品类，在库存充足（预售活动除外）的情况下，顾客可根据需要，选择更换相同商品下其他同等价格的不同规格商品；</li>
          <li>（ 2 ）特卖商品无法更换不同商品。比如：秒杀/限时购/特价/赠品和拼团商品仅限更换当前规格SKU商品；其他特卖商品规则以具体页面说明为准。</li>
          <li>（ 3 ）礼品卡等特殊商品，暂不支持换货</li>
          <li>（ 4 ）赠品由于活动库存有限，换货时以换货页面库存提示为准。</li>
        </ul>
      </li>
      <li>
        <p>商品完好指商品能够保持原有品质、功能，包括商品本身、包装、配件、赠品（如购买时有赠品）及附带的商标吊牌、使用说明书等齐全（如申请退换货的商品为成套商品中的一个商礼盒、礼包，则需退此整套商品）顾客基于查验需要而打开商品包装，或者为确认商品的品质、功能而进行合理、适当的试用不影响商品的完好。对超出查验和试用需要而使用商品（如提供视验透明包装的产品仍破坏一次性封条、数码产品联网激活、刮开防伪查询码、商品出现磨损划痕或污渍）导致商品产生明显的价值贬损，影响二次销售的，则视为商品不完好。</p>
      </li>
      <li>
        <p>根据法律规定及商品性质，有如下商品不享受无理由退换货政策：</p>
        <ul></ul>
      </li>
      <li>（1）定制类商品；</li>
      <li>（2）鲜活易腐类商品；</li>
      <li>（3）在线下载或者您拆封的音像制品，计算机软件等数字化商品；</li>
      <li>（4）交付的报纸期刊类商品；</li>
      <li>（5）根据商品性质不适宜退换货，并经顾客在购买时确认的商品；
                  <ul>
          <li>a.拆封后易影响人身安全或者生命健康的商品，或者拆封后易导致商品品质发生改变的商品；</li>
          <li>b.一经激活或者试用后价值贬损较大的商品；</li>
          <li>c.销售时已明示的临近保质期的商品、有瑕疵的商品；</li>
          <li>d.其他根据商品性质不适宜退换货，在商品页面标注“不支持无理由退货”/“不支持无理由换货” /“不支持无理由退换货”并经顾客在购买时确认的商品；</li>
        </ul>
      </li>
      <li>
        <p>以下情况不予办理退换货/维修</p>
        <ul>
          <li>（1）任何非本商城出售的商品；</li>
          <li>（2）过保商品（超过质保期的商品）；</li>
          <li>（3）未经授权的维修、误用、碰撞、疏忽、滥用、进液、事故、改动、不正确的安装所造成的商品质量问题，或撕毁、涂改标贴、机器序号、防伪标记；</li>
          <li>（4）质保凭证信息与商品不符及被涂改的；</li>
          <li>（5）其他依法不应办理退换货的。</li>
        </ul>
      </li>
      <li>
        <p>温馨提示：</p>
        <ul>
          <li>（1）所有退换货及维修经过本商城客服中心确认后即可办理，如果商品存在质量问题，请务必说明原因。未与本商城客服中心确认之前自行退回的商品将无法受理；</li>
          <li>（2）本商城保证出货时货物外包装的完好无缺。为了保证顾客的利益，请顾客在收到货物时务必验货，请拆开包装箱，确认货品完好 无损后再签收。如果发现货物在运输途中有破损，顾客有权拒收，请配送人员退回；</li>
          <li>（3）顾客在退还货品的途中，有责任保证所退还货品的安全及完整，如退还途中出现丢包、损坏（影响二次销售的），责任由顾客承担；</li>
          <li>（4）本商城收到发生退换货的商品包裹后，会对退回的商品进行全程拆箱录像质检，确认商品符合退换货要求后，再进行退款或者换货操作；</li>
          <li>（5）申请退货后，订单内剩余商品不满足赠品获取条件时，本商城有权利要求顾客退回赠品，若赠品丢失或者破损，本商城将按照赠品价值在退款中扣取相关费用。</li>
        </ul>
      </li>
    </ul>
  </div>
)

const 退换货运费谁来承担 = (
  <div>
    <h2>退换货运费谁来承担？</h2>
    <ul>
      <li>
        <p>因商品质量问题及商城本身的原因产生的退换货，退换货运费由本商城承担。</p>
        <p></p>
        <p>注意：退货暂不支持“快递费用到付”业务，请顾客务必先行垫付运费，并将运单一并寄回。到货验证商品后，我们将为用户报销运费。如果是未经确认而擅自退回的商品，该退换货申请将不被受理，您的货物有可能因系统无对应记录 而被售后部门拒收或导致丢失。</p>
      </li>
      <li>
        <p>因顾客主观原因（如不满足顾客某些功能的需求） 而产生的退换货，退换货运费由顾客个人承担。具体退换货事项请联系客服咨询。</p>
      </li>
    </ul>
  </div>
)

const 退换货流程及地址说明 = (
  <div>
    <h2>退换货流程及地址说明</h2>
    <p>请务必在退换货发货前，联系客服申请退换货服务。未经确认擅自发回的商品，可能因系统无对应记录 而被拒收或导致丢失。</p>
  </div>
)

const 退款处理时间以及去向 = (
  <div>
    <h2>退款处理时间以及去向</h2>
    <p>收到退货并确认无误后，我们将在72小时内进行退款。所退款项将原路返还，由于不同的银行系统处理的时间不同，预计1-5个工作日到账。</p>
  </div>
)
